000100 IDENTIFICATION DIVISION.
000200   PROGRAM-ID. AddSubtract.
000300 DATA DIVISION.
000400   WORKING-STORAGE SECTION.
000500   01 A PIC 9(4) VALUE 20.
000600   01 B PIC 9(4) VALUE 50.
000700   01 C PIC S9(4).
000750   01 D PIC S9(4).
000800 PROCEDURE DIVISION.
001000   DISPLAY "A = "A.
001100   DISPLAY "B = "B.
001200   ADD A TO B GIVING C.
001300   SUBTRACT B FROM A GIVING D.
001400   DISPLAY "A + B = "C.
001500   DISPLAY "A - B = "D.
001600 STOP RUN.
